espressif/esp-idf/components/soc/esp32/include/soc/io_mux_struct.h
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio2;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio0;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio4;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio16;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio17;
    union {
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } gpio9;
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } sd_data_2;
    };
    union {
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } gpio10;
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } sd_data_3;
    };
    union {
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } gpio11;
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } sd_cmd;
    };
    union {
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } gpio6;
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } sd_clk;
    };
    union {
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } gpio7;
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } sd_data_0;
    };
    union {
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } gpio8;
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } sd_data_1;
    };
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio5;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio18;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio19;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } reserved_gpio20;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
