espressif/esp-idf/components/soc/esp32/include/soc/io_mux_struct.h
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio21;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio22;
    union {
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } gpio3;
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } u0rxd;
    };
    union {
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } gpio1;
        union {
            struct {
                uint32_t slp_oe:      1;                /* Output enable in sleep mode */
                uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
                uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
                uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
                uint32_t slp_ie:      1;                /* Input enable in sleep mode */
                uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
                uint32_t fun_pd:      1;                /* Pulldown enable */
                uint32_t fun_pu:      1;                /* Pullup enable */
                uint32_t fun_ie:      1;                /* Input enable */
                uint32_t fun_drv:     2;                /* Drive strength */
                uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
                uint32_t reserved15:  17;                
            };
            uint32_t val;
        } u0txd;
    };
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio23;
    union {
        struct {
            uint32_t slp_oe:      1;                /* Output enable in sleep mode */
            uint32_t slp_sel:     1;                /* Pin used for wakeup from sleep */
            uint32_t slp_pd:      1;                /* Pulldown enable in sleep mode */
            uint32_t slp_pu:      1;                /* Pullup enable in sleep mode */
            uint32_t slp_ie:      1;                /* Input enable in sleep mode */
            uint32_t slp_drv:     2;                /* Drive strength in sleep mode */
            uint32_t fun_pd:      1;                /* Pulldown enable */
            uint32_t fun_pu:      1;                /* Pullup enable */
            uint32_t fun_ie:      1;                /* Input enable */
            uint32_t fun_drv:     2;                /* Drive strength */
            uint32_t fun_sel:     3;                /* Function select (possible values are defined for each pin as FUNC_pinname_function in io_mux_reg.h) */
            uint32_t reserved15:  17;                
        };
        uint32_t val;
    } gpio24;
} io_mux_dev_t;
extern io_mux_dev_t IOMUX;

#ifdef __cplusplus
}
#endif

#endif  /* _SOC_IO_MUX_STRUCT_H_ */
